# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

News.create(picture_url: 'http://grytsenko.com.ua/images/news/7065.jpg', title: 'Тестова новина', html: 'Міністерство оборони України зобов\'язане негайно припинити експеримент, який передбачає повернення в армію військових кухарів. Про у коментарі Українським Новинам заявив лідер партії „Громадянська позиція” Анатолій Гриценко.')
News.create(picture_url: 'http://grytsenko.com.ua/images/news/7065.jpg', title: 'Тестова новина', html: 'Міністерство оборони України зобов\'язане негайно припинити експеримент, який передбачає повернення в армію військових кухарів. Про у коментарі Українським Новинам заявив лідер партії „Громадянська позиція” Анатолій Гриценко.')

Blog.create(title: 'Тестовий блог', html: 'Свіжа новина від міністра фінансів Наталії Яресько: "Низку законопроектів щодо структурних реформ, новий Податковий кодекс України та проект Держбюджету-2016 плануємо подати до Верховної Ради у найближчі тижні".
Найближчі тижні, скільки їх? Не один, це точно. Значить, мінімум два. Або три. Або чотири... Міністр не уточнила. Можна лише гадати. Без гадання із повідомлення Яресько ясно одне - Уряд Порошенка-Яценюка планує у грудні системний гоп-стоп. З так само системними, але абсолютно непрогнозованими наслідками. Чому гоп-стоп?
Тому що буде порушено вимоги кількох Законів. І про регламент Ради, бо в такі терміни неможливо дотримати законні процедури, не кажучи вже про всебічне вивчення, змістовне обговорення, внесення необхідних поправок до урядових проектів, у яких зазвичай купа ляпів, нестиковок та ще й приховані корупційно-лоббістські схеми. І норму Закону про неприпустимість запровадження податкових змін, мінімум, лише через півроку після їх схвалення. Гарант цих порушень не зупинить - він натомість гарантуватиме і проштовхуватиме режим гоп-стоп.
')

Photo.create(src: 'john1.jpg')
Photo.create(src: 'john2.jpg')
Photo.create(src: 'john3.jpg')
Photo.create(src: 'john4.jpg')
Photo.create(src: 'john5.jpg')
Photo.create(src: 'john6.jpg')